<template>
  <div class="home">
    <div class="box">
      <div
        class="one"
        v-for="(item, index) in arr"
        :key="index"
        @click="jump(item)"
        :style="{ 'margin-top': index < 2 ? '0px' : '' }"
      >
        <!-- <span class="title">{{ item.title }}</span> -->
        <span class="title">{{ item.name }}</span>
        <span class="position">{{ item.position }}</span>
        <div style="display: flex">
          <svg
            xmlns="http://https://www.w3.org/2000/svg"
            xmlns:xlink="http://www.w3.org/1999/xlink"
            fill="none"
            version="1.1"
            width="20"
            height="20"
            viewBox="0 0 20 20"
          >
            <defs>
              <clipPath id="master_svg0_1_238">
                <rect x="0" y="0" width="20" height="20" rx="0" />
              </clipPath>
            </defs>
            <g clip-path="url(#master_svg0_1_238)">
              <g>
                <path
                  d="M3.0736052734375,7.7074221875L3.0736052734375,16.9714921875L16.9699052734375,16.9714921875L16.9699052734375,4.2332021875L14.6537052734375,4.2332021875L14.6537052734375,4.8123021875C14.6537052734375,4.9812521875,14.5994052734375,5.1199221875,14.4908052734375,5.2285121875C14.3822052734375,5.3371121875,14.2435052734375,5.391402187500001,14.0748052734375,5.391402187500001C13.9058052734375,5.391402187500001,13.7672052734375,5.3371121875,13.6586052734375,5.2285121875C13.5500052734375,5.1199221875,13.4957052734375,4.9812521875,13.4957052734375,4.8123021875L13.4957052734375,4.2332021875L6.5476352734375,4.2332021875L6.5476352734375,4.8123021875C6.5476352734375,4.9812521875,6.4933352734375,5.1199221875,6.3847452734375,5.2285121875C6.2761452734375,5.3371121875,6.1374752734375,5.391402187500001,5.9685352734375,5.391402187500001C5.799585273437501,5.391402187500001,5.6609152734374995,5.3371121875,5.5523152734375,5.2285121875C5.4437252734375,5.1199221875,5.389425273437499,4.9812521875,5.389425273437499,4.8123021875L5.389425273437499,4.2332021875L3.0736052734375,4.2332021875L3.0736052734375,6.5492221875L16.9699052734375,6.5492221875L16.9699052734375,7.7072321875L3.0736052734375,7.7074221875ZM6.5476352734375,3.0753921875000003L13.4957052734375,3.0753921875000003L13.4957052734375,2.4962891875C13.4957052734375,2.3273441875,13.5500052734375,2.1886721875,13.6586052734375,2.0800781875C13.7672052734375,1.9714843875,13.9058052734375,1.9171875005,14.0748052734375,1.9171875005C14.2437052734375,1.9171875005,14.3824052734375,1.9714843875,14.4910052734375,2.0800781875C14.5996052734375,2.1886721875,14.6537052734375,2.3273441875,14.6537052734375,2.4962891875L14.6537052734375,3.0753921875000003L17.5488052734375,3.0753921875000003C17.717705273437502,3.0753921875000003,17.856405273437503,3.1296921875,17.9650052734375,3.2382821875000003C18.0736052734375,3.3468721875,18.1277052734375,3.4855421875,18.1277052734375,3.6544921875L18.1277052734375,17.5507921875C18.1277052734375,17.7196921875,18.0734052734375,17.8583921875,17.9650052734375,17.9669921875C17.856405273437503,18.0755921875,17.717705273437502,18.1296921875,17.5488052734375,18.1296921875L2.4945072734375,18.1296921875C2.3255612734375,18.1296921875,2.1868892734375,18.0753921875,2.0782962734375,17.9669921875C1.9697021734375,17.8583921875,1.9154052734375,17.7196921875,1.9154052734375,17.5507921875L1.9154052734375,3.6543021875C1.9154052734375,3.4853521875,1.9697021734375,3.3466821875,2.0782962734375,3.2380821875C2.1868892734375,3.1294921875,2.3255612734375,3.0751921875,2.4945072734375,3.0751921875L5.3896252734375,3.0751921875L5.3896252734375,2.4960941875C5.3896252734375,2.3271481875,5.4439252734375,2.1884761875,5.5525152734375,2.0798831875C5.661105273437499,1.9712890875,5.7997852734375,1.9169921875,5.9687252734375,1.9169921875C6.1376752734375,1.9169921875,6.2763452734375,1.9712890875,6.3849352734375,2.0798831875C6.4935352734375,2.1884761875,6.5478252734375,2.3271481875,6.5478252734375,2.4960941875L6.5478252734375,3.0753921875000003L6.5476352734375,3.0753921875000003ZM5.9685352734375,10.0234421875L7.1265352734375,10.0234421875C7.2954852734375,10.0234421875,7.4341552734375,10.0777321875,7.5427452734375,10.1861321875C7.6513452734375,10.2947321875,7.7056452734375,10.4334021875,7.7056452734375,10.6023421875C7.7056452734375,10.7712921875,7.6513452734375,10.9099621875,7.5427452734375,11.0185521875C7.4341552734375,11.1271521875,7.2954852734375,11.1812521875,7.1265352734375,11.1812521875L5.9685352734375,11.1812521875C5.799585273437501,11.1812521875,5.6609152734374995,11.1269521875,5.5523152734375,11.0185521875C5.4437252734375,10.9099621875,5.389425273437499,10.7712921875,5.389425273437499,10.6023421875C5.389425273437499,10.4334021875,5.4437252734375,10.2947321875,5.5523152734375,10.1861321875C5.6609152734374995,10.0777321875,5.7997852734375,10.0234421875,5.9685352734375,10.0234421875ZM5.9685352734375,13.4974921875L7.1265352734375,13.4974921875C7.2954852734375,13.4974921875,7.4341552734375,13.5517921875,7.5427452734375,13.6601921875C7.6513452734375,13.7687921875,7.7056452734375,13.9073921875,7.7056452734375,14.0763921875C7.7056452734375,14.2452921875,7.6513452734375,14.3839921875,7.5427452734375,14.4925921875C7.4341552734375,14.6011921875,7.2954852734375,14.6552921875,7.1265352734375,14.6552921875L5.9685352734375,14.6552921875C5.799585273437501,14.6552921875,5.6609152734374995,14.6009921875,5.5523152734375,14.4925921875C5.4437252734375,14.3839921875,5.389425273437499,14.2452921875,5.389425273437499,14.0763921875C5.389425273437499,13.9073921875,5.4437252734375,13.7687921875,5.5523152734375,13.6601921875C5.6609152734374995,13.5517921875,5.7997852734375,13.4974921875,5.9685352734375,13.4974921875ZM9.442745273437499,10.0234421875L10.6007552734375,10.0234421875C10.7697052734375,10.0234421875,10.9083752734375,10.0777321875,11.0169652734375,10.1861321875C11.1255652734375,10.2947321875,11.1798552734375,10.4334021875,11.1798552734375,10.6023421875C11.1798552734375,10.7712921875,11.1255652734375,10.9099621875,11.0169652734375,11.0185521875C10.9083752734375,11.1271521875,10.7697052734375,11.1812521875,10.6007552734375,11.1812521875L9.442745273437499,11.1812521875C9.2738052734375,11.1812521875,9.1351352734375,11.1269521875,9.0265352734375,11.0185521875C8.9179452734375,10.9099621875,8.8636452734375,10.7712921875,8.8636452734375,10.6023421875C8.8636452734375,10.4334021875,8.9179452734375,10.2947321875,9.0265352734375,10.1861321875C9.1351352734375,10.0777321875,9.2738052734375,10.0234421875,9.442745273437499,10.0234421875ZM9.442745273437499,13.4974921875L10.6007552734375,13.4974921875C10.7697052734375,13.4974921875,10.9083752734375,13.5517921875,11.0169652734375,13.6601921875C11.1255652734375,13.7687921875,11.1798552734375,13.9073921875,11.1798552734375,14.0763921875C11.1798552734375,14.2452921875,11.1255652734375,14.3839921875,11.0169652734375,14.4925921875C10.9083752734375,14.6011921875,10.7697052734375,14.6552921875,10.6007552734375,14.6552921875L9.442745273437499,14.6552921875C9.2738052734375,14.6552921875,9.1351352734375,14.6009921875,9.0265352734375,14.4925921875C8.9179452734375,14.3839921875,8.8636452734375,14.2452921875,8.8636452734375,14.0763921875C8.8636452734375,13.9073921875,8.9179452734375,13.7687921875,9.0265352734375,13.6601921875C9.1351352734375,13.5517921875,9.2738052734375,13.4974921875,9.442745273437499,13.4974921875ZM12.9168052734375,10.0234421875L14.0748052734375,10.0234421875C14.2437052734375,10.0234421875,14.3824052734375,10.0777321875,14.4908052734375,10.1861321875C14.5994052734375,10.2947321875,14.6537052734375,10.4334021875,14.6537052734375,10.6023421875C14.6537052734375,10.7712921875,14.5994052734375,10.9099621875,14.4908052734375,11.0185521875C14.3822052734375,11.1271521875,14.2435052734375,11.1812521875,14.0748052734375,11.1812521875L12.9168052734375,11.1812521875C12.7478052734375,11.1812521875,12.6092052734375,11.1269521875,12.5006052734375,11.0185521875C12.3920052734375,10.9099621875,12.3377052734375,10.7712921875,12.3377052734375,10.6023421875C12.3377052734375,10.4334021875,12.3920052734375,10.2947321875,12.5006052734375,10.1861321875C12.6092052734375,10.0777321875,12.7478052734375,10.0234421875,12.9168052734375,10.0234421875ZM12.9168052734375,13.4974921875L14.0748052734375,13.4974921875C14.2437052734375,13.4974921875,14.3824052734375,13.5517921875,14.4908052734375,13.6601921875C14.5994052734375,13.7687921875,14.6537052734375,13.9073921875,14.6537052734375,14.0763921875C14.6537052734375,14.2452921875,14.5994052734375,14.3839921875,14.4908052734375,14.4925921875C14.3822052734375,14.6011921875,14.2435052734375,14.6552921875,14.0748052734375,14.6552921875L12.9168052734375,14.6552921875C12.7478052734375,14.6552921875,12.6092052734375,14.6009921875,12.5006052734375,14.4925921875C12.3920052734375,14.3839921875,12.3377052734375,14.2452921875,12.3377052734375,14.0763921875C12.3377052734375,13.9073921875,12.3920052734375,13.7687921875,12.5006052734375,13.6601921875C12.6092052734375,13.5517921875,12.7478052734375,13.4974921875,12.9168052734375,13.4974921875Z"
                  fill="#FFFFFF"
                  fill-opacity="1"
                />
              </g>
            </g>
          </svg>
          <span class="time">{{ item.time }}</span>
        </div>
      </div>
    </div>
  </div>
</template>

<script>

export default {
  name: 'HomeView',
  data () {
    return {
      arr: [
        { "name": "訚柏", "position": "中央政法委秘书长", "time": "11.19至11.22", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc8019332f87faa2ae1&sign=82b0d057468048ba8d4ce5157fa04769#/schedule" },
        { "name": "怀进鹏", "position": "教育部党组书记、部长", "time": "11.19至11.20", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d06f5932e48&sign=27521d7fd27449bfa10a9cf20e05b77f#/schedule" },
        { "name": "阿东", "position": "共青团中央书记处第一书记", "time": "11.19至11.20", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d09ad2d2e68&sign=c88899c552ca4dc09f0836bb1fa4fbe3#/schedule" },
        { "name": "陈建文", "position": "人民日报社总编辑", "time": "11.19至11.21", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d0ab7432e8b&sign=a6280763e0a745f5a74f4cb1c9c6bbf3#/schedule" },
        { "name": "吕岩松", "position": "新华社总编辑、党组副书记", "time": "11.19至11.20", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d0bd4b02eb2&sign=1c8ba0214aa34ef5b1ef2c1ced766b1e#/schedule" },
        { "name": "陈瑞峰", "position": "中央统一战线工作部副部长，国家宗教事务局局长", "time": "11.19至11.21", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d0cf7dc2ef8&sign=f69cd7d617f741c280bc1ba11ea9bc41#/schedule" },
        { "name": "王京涛", "position": "中央网信办副主任", "time": "11.19至11.21", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d1182262f41&sign=316f14c6afd64aeda02ddb06d0bd6e89#/schedule" },
        { "name": "杨建文", "position": "中央网信办副主任", "time": "11.19至11.21", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d126ace2f65&sign=6c8aab20b00a44b68c70aed63620f55f#/schedule" },
        { "name": "宋德民", "position": "驻中央宣传部纪检监察组组长", "time": "11.19至11.21", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d14957c2fab&sign=842c66b67de3451d9f9009f1bf678c91#/schedule" },
        { "name": "李克新", "position": "中央外事工作委员会办公室副主任", "time": "11.19至11.20", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d1595b02fcd&sign=4a4fef3f807443b29ec9cc3312652d6c#/schedule" },
        { "name": "张志军", "position": "国务院台湾事务办公室副主任", "time": "11.19至11.21", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d166dd82fec&sign=5f696f2920784bff96dc8ded3cbc7b09#/schedule" },
        //{ "name": "李谦", "position": "国家安全部副部长", "time": "11.19至11.22", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d174e5f3010&sign=52b67cb935cd41279ba8349f5bfe56e5#/schedule" },
        { "name": "刘烈宏", "position": "国家发展和改革委员会党组成员，国家数据局党组书记、局长", "time": "11.19至11.21", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d19940f305e&sign=6c19e8de4d694a0f9ed7e56cdc4c339f#/schedule" },
        { "name": "王光彦", "position": "教育部副部长", "time": "11.20至11.21", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d1ae784307e&sign=219c55fd60f1411e97238deeba3309b4#/schedule" },
        { "name": "陈思源", "position": "公安部副部长", "time": "11.19至11.20", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d1baecd30a1&sign=f404a667d815408c8f545f26a5b2e941#/schedule" },
        { "name": "张云明", "position": "工业和信息化部副部长", "time": "11.19至11.21", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d27f7c230c4&sign=2776fdf881e9457895e6b086ac6ee2f3#/schedule" },
        { "name": "郭婷婷", "position": "财政部党组成员、副部长", "time": "11.19至11.21", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d28db7930e6&sign=906337777a6c4cb5ba32fb70c3d38621#/schedule" },
        //{ "name": "谭作钧", "position": "国务院国有资产监督管理委员会党委委员、副主任", "time": "11.19至11.21", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d298216310a&sign=d03db3527aaf4f9fb4d9bd510629b634#/schedule" },
        { "name": "龙腾", "position": "科学技术部党组成员、副部长", "time": "11.19至11.20", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d2bf796312e&sign=d8920c50d1aa4767bc1919aadfb5bb69#/schedule" },
        { "name": "李忠", "position": "人力资源社会保障部党组成员、副部长", "time": "11.19至11.21", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d31ac553152&sign=59de27c927b34786beaa360a59ac5eb8#/schedule" },
        { "name": "李常官", "position": "民政部党组成员、副部长", "time": "11.19至11.21", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d3276013175&sign=b87400b4193a43ff8cf26f3cff5007f2#/schedule" },
        { "name": "王刚", "position": "交通运输部党组成员、副部长", "time": "11.19至11.20", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d334de73199&sign=467daacd7d4f44cc9e6ba148116dedd5#/schedule" },
        { "name": "柳军", "position": "国家市场监督管理总局副局长", "time": "11.19至11.21", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d33fdff31b8&sign=b7d1283a6e8243cc9d615cd308270d59#/schedule" },
        { "name": "王本强", "position": "审计署党组成员，副审计长", "time": "11.19至11.20", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d35459e31dd&sign=30f593b3ad5e4835898420afc4fc4060#/schedule" },
        { "name": "郭芳", "position": "生态环境部党组成员、副部长", "time": "11.19至11.20", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d35c8b631fc&sign=ab85bd08eec742d696f140c39aeef2e3#/schedule" },
        { "name": "吴海平", "position": "海关总署副署长、党委委员", "time": "11.19至11.22", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d36f45c321f&sign=3937ed697773414abea56db8f6bc015b#/schedule" },
        { "name": "易小准", "position": "商务部原副部长", "time": "11.19至11.22", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d39db773245&sign=984fa61c7ddc460799c8543af14ef4cf#/schedule" },
        { "name": "郑国光", "position": "中国灾害防御协会、应急管理部中国灾害防御协会会长、应急管理部原副部长", "time": "11.20至11.22", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d3f595c326c&sign=3aa11433be5d41158310e55b73194751#/schedule" },
        { "name": "董昕", "position": "国家广播电视总局党组成员、副局长", "time": "11.19至11.22", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d3fef4b3291&sign=faf0c80ed3274885a70480fe83d17be5#/personnel" },
        { "name": "范昀", "position": "中央广播电视总台党组成员、副总编辑、CGTN 总编辑", "time": "11.19至11.20", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d40a92132b2&sign=8682de204a4d4c3682501bdcf8a48862#/schedule" },
        { "name": "杜占元", "position": "中国外文局局长", "time": "11.19至11.21", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d41737832d0&sign=9c05a82b248d4fedbaee00a1cc1da429#/schedule" },
        { "name": "王洪祥", "position": "中国法学会党组书记、常务副会长", "time": "11.20至11.21", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d42356632f3&sign=748f89546d6647b29b67210655949d0d#/schedule" },
        { "name": "姜伟", "position": "中国法学会副会长", "time": "11.19至11.22", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d448cad3316&sign=9093d8729870468483f28f4383cb8bfb#/schedule" },
        { "name": "王忠民", "position": "全国社保基金理事会副主席，副理事长", "time": "11.19至11.22", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d4824f7333d&sign=19b9818a21624a13aa14d4ddffaaaa74#/schedule" },
        { "name": "尹九阳", "position": "国信中心正高级工程师", "time": "11.20至11.21", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d4a6c313364&sign=f195cd64573d4a09af9ecafbf33d3a80#/schedule" },
        { "name": "贾宇", "position": "上海市高级人民法院党组书记、院长", "time": "11.20至11.21", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d4b20383387&sign=041beb1f329946138116d0bdcdd473a8#/schedule" },
        { "name": "赵嘉鸣", "position": "上海市委常委、宣传部部长", "time": "11.19至11.20", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d4ca53733aa&sign=6f163289d5b04fadaebb82022c30159a#/schedule" },
        { "name": "徐缨", "position": "江苏省委常委、江苏省委宣传部部长", "time": "11.19至11.20", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d4edbe833cd&sign=8b46efbefc9a475080aa2676ce4f04d8#/schedule" },
        { "name": "郑莉", "position": "四川省委常委、宣传部部长", "time": "11.19至11.21", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d4f5d5b33f0&sign=1955ecd1e6764a5985f16b43255a1030#/schedule" },
        { "name": "陈奕君", "position": "广西壮族自治区党委常委、宣传部部长", "time": "11.19至11.21", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d5212f43413&sign=176ef515aed94e539ce7ba595f46368b#/schedule" },
        { "name": "郑庆东", "position": "经济 日报社社长兼总编辑", "time": "11.18至11.21", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d52c9bc343c&sign=a5e8f3888a5945c497ec34c86d701d31#/schedule" },
        { "name": "薛军", "position": "军方专家", "time": "11.19至11.22", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d5411313486&sign=31c1613c495646c3bbb23c7f4bdf05ab#/schedule" },
        { "name": "刘彬", "position": "外交部部党委委员、部长助理", "time": "11.18至11.20", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d54ae6e34a9&sign=a11a6c0477804a66b46e0f76d1a25d08#/schedule" },
        { "name": "赵世通", "position": "中央对外联络部部长助理", "time": "11.19至11.20", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d5593f334cc&sign=0c2abea1aa8b4dc3a479d5c2bfe0e512#/schedule" },
        { "name": "金艳丽", "position": "国家信访局党组成员、副局长", "time": "11.19至11.21", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d56416234ed&sign=cee6219a828249aea70477f8062466f5#/schedule" },
        { "name": "孙秀春", "position": "国家机关事务管理局副局长", "time": "11.18至11.21", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d570f633512&sign=2ab28714a97e4e69aeefbac4b5c77118#/schedule" },
        { "name": "梁楠", "position": "中国民用航空局副局长", "time": "11.19至11.20", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d57c3d73539&sign=84e57730d0674166b25bf06f15b0e2f6#/schedule" },
        { "name": "赵峰涛", "position": "国家国际发展合作署副署长", "time": "11.19至11.21", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d5a245b3558&sign=64585a2f6b694258b2e9628685744da3#/schedule" },
        { "name": "陈荣辉", "position": "国家数据局副局长", "time": "11.19至11.23", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d5ac752357b&sign=b1e6677fdbfc461e9a1061b7dab2fc76#/schedule" },
        { "name": "李庆霜", "position": "中国国际贸易促进委员会副会长", "time": "11.20至11.21", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d5b4160359c&sign=363833fffd124f1095750c9276816450#/schedule" },
        { "name": "吴世忠", "position": "中央保密办（国家保密局）中国工程院院士、国家保密科技委主任", "time": "11.19至11.21", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d5c1a5635bf&sign=cca3104f89354d37966d2196858d1474#/schedule" },
        { "name": "于运全", "position": "中国外文局副局长", "time": "11.20至11.21", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d5d084735e1&sign=cccf511e5c3c44d692b51e01257ed938#/schedule" },
        { "name": "王艺", "position": "共青团中央书记处书记、全国青联副主席", "time": "11.19至11.21", "url": "https://zhjd.zjswb.cn:7443/xcc_mobile_2024_static/?planId=8a8081789221dbc801933d5dbe753604&sign=07ccb3a0528343de8b37a5746db15471#/schedule" }
      ]
    }
  },
  methods: {
    jump (item) {
      if (item.url) window.open(item.url)
    }
  }
}
</script>
<style scoped>
.home {
  width: 100%;
  height: 100%;
  overflow: hidden;
  background: url("../assets/大图.png") no-repeat 0 0 / 100%;
}
.box {
  width: 100%;
  height: calc(100vh - 148px);
  margin-top: 178px;
  overflow: auto;
  border-radius: 6px;
  display: flex;
  flex-wrap: wrap;
  box-sizing: border-box;
  padding: 0 0 10px 16px;
  align-content: flex-start;
}
.box::-webkit-scrollbar {
  width: 0px;
}
.one {
  padding: 15px 15px 20px 15px;
  height: 155px;
  margin: 16px 16px 0 0;
  width: calc(50% - 16px);
  display: flex;
  flex-direction: column;
  justify-content: space-around;
  border: 1px solid #35b8ff;
  border-radius: 6px;
  opacity: 1;
  background: linear-gradient(180deg, rgba(69, 127, 241, 0.62) 2%, #023fc7 99%);
  box-sizing: border-box;
}
.title {
  /* margin-bottom: 8px; */
  font-family: Source Han Sans CN;
  font-size: 18px;
  font-weight: bold;
  line-height: 28px;
  letter-spacing: 0px;
  font-variation-settings: "opsz" auto;
  color: #ffffff;
}
.name {
  margin-bottom: 4px;
  font-family: Source Han Sans CN;
  font-size: 16px;
  font-weight: bold;
  line-height: 22px;
  letter-spacing: 0em;
  color: #ffffff;
}
.position {
  /* margin-bottom: 8px; */
  font-family: Source Han Sans CN;
  font-size: 14px;
  font-weight: 500;
  line-height: 20px;
  letter-spacing: 0em;
  color: #ffffff;
}
.time {
  margin-left: 4px;
  font-family: Source Han Sans CN;
  font-size: 16px;
  font-weight: 500;
  line-height: 22px;
  letter-spacing: 0em;
  color: #ffffff;
}
</style>
